### Indicator 1.1: You describe data mining activities based on choice of a basic machine learning model  technique and relevant required activities

<font color='blue'>
Read the description on https://www.kaggle.com/c/titanic
    
* What is the goal of the competition?
* What could be the "business goal" and success criteria behind it?
* What is the context/ available information?
* What is the information need?</font><font color='red'>
* Which supervised machine learning technique should be applied?
* What alternative machine learning models could be applied, and what would be the metric?
* What will be your activities in each of the CRISP DM phases?
    
</font>

### Indicator 1.2: You define data mining goals success criteria

<font color='blue'>
Read the evaluation on https://www.kaggle.com/c/titanic/overview/evaluation
    
* What is the data mining goal and success criterion?
* What is the metric, how does it relate to the criterion?
* How will you interpret the metric?
</font>

### Indicator 1.3: You add extra self-organised and/or external data sources to the data science process

<font color='blue'>
Describe this dataset:
    
* What is the number of rows and number of columns?
* Check the top and bottom rows of the dataset
* What does each row in the data represent?
* What is the data type of the columns, and what are the units?</font><font color='red'>
* What is the measurement level of the columns?
* What is the source of the data, how about confidentiality?
* For this competition, what additional information (data sources) would be relevant?
</font>

In [1]:
import pandas as pd

df = pd.read_csv('titanic/train.csv')

In [2]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
df.shape

(891, 12)

In [4]:
len(df)

891

In [6]:
len(df.loc[0])

12

In [9]:
df.head(3).transpose()

,0,1,2
PassengerId,1,2,3
Survived,0,1,1
Pclass,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina"
Sex,male,female,female
Age,22.0,38.0,26.0
SibSp,1,1,0
Parch,0,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282
Fare,7.25,71.2833,7.925
Cabin,NaN,C85,NaN
Embarked,S,C,S

In [17]:
# via colab werkt dit ook om alles te zien
output(df)

NameError: name 'output' is not defined